// 判断一个 9x9 的数独是否有效。只需要根据以下规则，验证已经填入的数字是否有效即可。

// 数字 1-9 在每一行只能出现一次。
// 数字 1-9 在每一列只能出现一次。
// 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。

// 数独部分空格内已填入了数字，空白格用 '.' 表示。

// 示例 1:
// 输入:
// [
//   ["5","3",".",".","7",".",".",".","."],
//   ["6",".",".","1","9","5",".",".","."],
//   [".","9","8",".",".",".",".","6","."],
//   ["8",".",".",".","6",".",".",".","3"],
//   ["4",".",".","8",".","3",".",".","1"],
//   ["7",".",".",".","2",".",".",".","6"],
//   [".","6",".",".",".",".","2","8","."],
//   [".",".",".","4","1","9",".",".","5"],
//   [".",".",".",".","8",".",".","7","9"]
// ]
// 输出: true

// 示例 2:
// 输入:
// [
//   ["8","3",".",".","7",".",".",".","."],
//   ["6",".",".","1","9","5",".",".","."],
//   [".","9","8",".",".",".",".","6","."],
//   ["8",".",".",".","6",".",".",".","3"],
//   ["4",".",".","8",".","3",".",".","1"],
//   ["7",".",".",".","2",".",".",".","6"],
//   [".","6",".",".",".",".","2","8","."],
//   [".",".",".","4","1","9",".",".","5"],
//   [".",".",".",".","8",".",".","7","9"]
// ]
// 输出: false
// 解释: 除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。
//      但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。

// 说明:
// 一个有效的数独（部分已被填充）不一定是可解的。
// 只需要根据以上规则，验证已经填入的数字是否有效即可。
// 给定数独序列只包含数字 1-9 和字符 '.' 。
// 给定数独永远是 9x9 形式的。

import java.util.HashSet;
import java.util.Set;

class Solution {
    private Set<Character> cache = new HashSet<>(9); // 记录出现过的数字

    public boolean isValidSudoku(char[][] board) {
        for (int i = 0; i < 9; i++) { // 检查行
            cache.clear();
            for (int j = 0; j < 9; j++) {
                var c = board[i][j];
                if (c == '.')
                    continue;
                if (cache.contains(c)) {
                    return false;
                } else {
                    cache.add(c);
                }
            }
        }
        for (int i = 0; i < 9; i++) { // 检查列
            cache.clear();
            for (int j = 0; j < 9; j++) {
                var c = board[j][i];
                if (c == '.')
                    continue;
                if (cache.contains(c)) {
                    return false;
                } else {
                    cache.add(c);
                }
            }
        }
        for (int i = 0; i < 9; i++) { // 检查小方格
            cache.clear();
            for (int j = 0; j < 3; j++) {
                for (int k = 0; k < 3; k++) {
                    var c = board[i / 3 * 3 + j][i % 3 * 3 + k];
                    if (c == '.')
                        continue;
                    if (cache.contains(c)) {
                        return false;
                    } else {
                        cache.add(c);
                    }
                }
            }
        }
        return true;
    }
}
